---
title: "LoRaWAN: IXMã§ã®LRRã®ãƒˆãƒ©ãƒ–ãƒ«ã‚·ãƒ¥ãƒ¼ãƒ†ã‚£ãƒ³ã‚°ã®ä¾‹"
emoji: "ğŸ¦"
type: "tech"
topics: [Cisco, LoRaWAN, Actility]
published: true
created: "2022-03-17"
---

Cisco LoRaWAN Gateway (IXM)ã§ Actility Packet Forwarder(LRR)ã‚’å‹•ã‹ã—ã¦ã„ã¦ã€ä½•ã‹å•é¡ŒãŒã‚ã£ãŸæ™‚ã®è§£æ±ºã®ãƒ’ãƒ³ãƒˆã‚’æŒ™ã’ã¦ã¿ã‚‹ã€‚
**è‡ªå·±è²¬ä»»**ã§ã©ã†ãã€‚

## IXMã§LRRã®ãƒ­ã‚°ã‚’è¦‹ã‚‹ã€‚

LRRã®ãƒ­ã‚°ã‚’è¦‹ã‚‹ã«ã¯ã€IXM-CLIã‹ã‚‰ show packet-forwarderã‚³ãƒãƒ³ãƒ‰ã‚’ä½¿ã†ã€‚

```
GW#show packet-forwarder log name trace 250
```

åˆ¥ã®æ–¹æ³•ã¨ã—ã¦ã€ã‚³ãƒ³ãƒ†ãƒŠã«ãƒ­ã‚°ã‚¤ãƒ³ã™ã‚‹ã¨éå»7æ—¥é–“ã®ãƒ­ã‚°ã‚’è¦‹ã‚‹ã“ã¨ãŒã§ãã‚‹ã€‚

ãŸã ã—ã€UNIXç³»OSã‚’ä½¿ã„æ…£ã‚Œã¦ã„ãªã„äººã¯ãŠå‹§ã‚ã—ãªã„ã€‚**è‡ªå·±è²¬ä»»**ã§ã€‚

*$ROOTACT/var/log/lrr/TRACE.log* ã« LRRã®ãƒ­ã‚°ãŒè¨˜éŒ²ã•ã‚Œã‚‹ã€‚

ãƒªã‚¢ãƒ«ã‚¿ã‚¤ãƒ ãªãƒ­ã‚°ã¯ä¸‹è¨˜ã‚³ãƒãƒ³ãƒ‰ã§è¦‹ã‚‹ã“ã¨ãŒã§ãã‚‹ã€‚
çµ‚äº†ã¯ `Ctrl+C` ã‚’æŠ¼ã™ã€‚

ã‚¿ãƒ¼ãƒŸãƒŠãƒ«ã‚¨ãƒŸãƒ¥ãƒ¬ãƒ¼ã‚¿ã«ã‚ˆã£ã¦ã¯ `Ctrl+C`ãŒåŠ¹ã‹ãªã„å ´åˆãŒã‚ã‚‹ã€‚
sttyã§è¨­å®šã™ã‚‹ã€‚è‡ªå·±è²¬ä»»ã§ã€‚

```
bash-3.2# tail -f $ROOTACT/var/log/lrr/TRACE.log
```

éå»ã®ãƒ­ã‚°ã¯ä¸‹è¨˜ãƒ•ã‚¡ã‚¤ãƒ«ã‚’å‚ç…§ã™ã‚‹ã€‚
1æ—¥ã”ã¨ã«ãƒ•ã‚¡ã‚¤ãƒ«ãŒå¤‰ã‚ã‚‹ã€‚
ãƒ•ã‚¡ã‚¤ãƒ«å½¢å¼ã¯ **TRACE_NN.log**
*NN*ã¯ 01ã‹ã‚‰ 07ã¾ã§ã€‚
01ãŒæœˆæ›œæ—¥ã«è©²å½“ã™ã‚‹ã€‚

## Trouble Shooting: `ERROR: received LrrID==0 from twa lrcid=201 idxlrc=0`

ä¸‹è¨˜ã®æ§˜ãªã‚¨ãƒ©ãƒ¼ãŒå‡ºç¶šã‘ã¦ã€NSå´ã§è¦‹ã‚‹ã¨ç™»éŒ²ãŒå®Œäº†ã—ãªã„ã€‚

```
01:14:37.211  (00880) [../main.c:4001] LAP LRC STARTED
01:14:37.211  (00880) [../main.c:4005] Get LrrID: from bootserver = 0, from twa = 1, lrrid=00000000
01:14:37.211  (00880) [../main.c:567] LRR send lrruid='005F86-024B069606FCF' to lrc='(null)' twa sz=284 idxlrc=1
01:14:37.463  (00880) [../main.c:4043] LAP RECV sz=28 szh=28 psz=0 lrrid=000000ca typ=32/32768(I) tms=0 rqtdelay=0
01:14:37.463  (00880) [../main.c:3560] get lrrid=00000000 from twa lrcuid=202 idxlrc=1
01:14:37.463  (00880) [../main.c:3593] ERROR: received LrrID==0 from twa lrcid=202 idxlrc=1 ! => retry later
01:14:41.543  (00880) [../main.c:6686] On timer failed to get lrrid from twa => lrrid '69606fcf' used
```

TWAã¯èªè¨¼ã‚µãƒ¼ãƒã€‚
åˆ¥ã®ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã«ç™»éŒ²ã•ã‚Œã¦ã„ã‚‹ã€‚

åˆ¥ã®ã‚¤ãƒ³ã‚¹ã‚¿ãƒ³ã‚¹ã®ç™»éŒ²ã‚’å‰Šé™¤ã—ã¦ã—ã°ã‚‰ãå¾…ã¤ã€‚
ãŸã ã—ã€12æ™‚é–“ã§ã¯æ”¹å–„ã—ãªã‹ã£ãŸã€‚
TPCPã‹ã‚‰å‰Šé™¤ã—ã¦ã‚„ã‚ŠãªãŠã—ã¦ã‚‚æ”¹å–„ã—ãªã‹ã£ãŸã€‚
1æ—¥çµŒéã™ã‚‹ã¨ã¤ãªãŒã‚‹ã‚ˆã†ã«ãªã£ãŸã€‚

## Trouble Shooting: packet-forwarder firmware is not installed

packet forwarderã®çŠ¶æ…‹ãŒè¦‹ã‚Œãªã„ã€‚

```
GW#show packet-forwarder status
packet-forwarder firmware is not installed
```

ã‚¤ãƒ³ã‚¹ãƒˆãƒ¼ãƒ«ãŒå¤±æ•—ã—ã¦ã„ã‚‹ã€‚
ã‚ã‚ŠãŒã¡ãªã®ãŒä¸‹è¨˜ã®æ§˜ã«ã‚­ãƒ¼ãƒ¯ãƒ¼ãƒ‰ã‚’é–“é•ãˆã¦ã„ã‚‹ã€‚

```
GW(config)#packet-forwarder install firmware TP_Enterprise_BS_Image_cisco.C
ISCO_CIXM.1_any_TPCP_SAAS_2.6.53_v1.0_no-keygen.cpkg
packet-forwarder firmware validation failed
```

## Trouble Shooting: NSã«ã¤ãªãŒã‚‰ãªã„ã€‚

20åˆ†ãŸã£ã¦ã‚‚ã¤ãªãŒã‚‰ãªã„å ´åˆã€ä¸‹è¨˜ã®ãƒ­ã‚°ãŒå‡ºåŠ›ã•ã‚Œã‚‹ã€‚

```
16:07:43.393  (31526) [../main.c:6164] no LRC connection during more than 1200sec => revssh
```

LRCã¾ã§ã®æ¥ç¶šæ€§ãŒãªã„ã€‚
åŸºæœ¬çš„ãªãƒã‚§ãƒƒã‚¯ã‚’ã—ã¦ã‚‚ã¤ãªãŒã‚‰ãªã„å ´åˆã¯ã€IPsecã®è¨­å®šãŒé–“é•ã£ã¦ã„ã‚‹å¯èƒ½æ€§ãŒã‚ã‚‹ã€‚

## Trouble Shooting: One session to container console is already open.

ä¸‹è¨˜ã®ã‚¨ãƒ©ãƒ¼ãŒå‡ºã¦ã€ã‚³ãƒ³ãƒ†ãƒŠã«ã¤ãªãŒã‚‰ãªã„ã€‚

```
GW#request shell container-console 
Enter System Password:  
One session to container console is already open.
Only one session to container console is allowed.
```

ã‚³ãƒ³ãƒ†ãƒŠã®ã‚»ãƒƒã‚·ãƒ§ãƒ³ãŒæ®‹ã£ã¦ã„ã‚‹ã€‚

ã‚³ãƒ³ãƒ†ãƒŠã‚’å†èµ·å‹•ã™ã‚‹ã€‚

```
GW(config)#container disable 
Reset Container's private network...
Container is stopped.
```

```
GW(config)#no container disable 
Container is started.
```

ãŸã ã—ã€ã‚³ãƒ³ãƒ†ãƒŠã‚’å†èµ·å‹•ã™ã‚‹ã¨GPSã‚¢ãƒ³ãƒ†ãƒŠã®ã‚¢ã‚¯ã‚»ã‚¹ãŒã§ããªããªã‚‹å ´åˆãŒã‚ã‚‹ã€‚
ãã®éš›ã¯IXMã‚’å†èµ·å‹•ã™ã‚‹ã€‚

## Trouble Shooting: cannot open gps device

```
15:26:52.872  (03554) [../gps.c:202] ERROR: opening TTY port for GPS failed - Too many levels of symbolic links (/dev/ttyS1)
15:26:52.872  (03554) [../gps.c:180] GPS cannot open gps device '/dev/ttyS1'
```

GPSã¸ã®ã‚¢ã‚¯ã‚»ã‚¹ãŒã§ãã¦ã„ãªã„ã€‚
IXMã‚’å†èµ·å‹•ã™ã‚‹ã€‚

## Trouble Shooting: RADIO cannot be started

```
15:27:18.453  (26629) [../lgw_x8.c:1282] BOARD1 RADIO cannot be started ret=-1 'Invalid version number for the top FPGA'
```

radio off ã«ãªã£ã¦ã„ã‚‹ã€‚

